# FamilyManager.Parameter Property

---
Obtains a parameter based on an identifier.
| Name| Description
---|---|---
| ParameterBuiltInParameter| Obtains the parameter of this type with a given parameter id.
| ParameterDefinition| Obtains the parameter of this type with a given definition.
| ParameterGuid| Obtains the parameter of this type with a given GUID for a shared parameter.
| ParameterString| Obtains the parameter of this type with a given name.
Top
#### Reference
FamilyManager Class
Autodesk.Revit.DB Namespace